{
    "articles": [
      {
        "id": 1,
        "title": "Solid State Batteries: How Our Future Phones Could Benefit From this Technology and How it Differs from Lithium Polymer and Lithium Ion Batteries",
        "content": "We recently talked about how Samsung might be working on developing solid-state batteries for smartphones as the company has filed some patents and has even started working on a prototype. However we know that it will take some time before these batteries are finally available to the masses. But until that happens we can step back and start looking at what solid-state batteries are and how they differ from lithium polymer and lithium-ion batteries two of the most common batteries in the smartphone market. How do solid-state batteries differ from lithium-ion batteries in the market? The lithium-ion batteries we see in the market comprise a cathode anode separator and electrolyte. In comparison a solid-state battery uses solid electrolytes instead of liquid. \n\nResearch has also shown that solid-state batteries are better in terms of overall stability and safety as they do not catch fire or start swelling up which is a commonissue in a lot of li-ion batteries available in the market. Below is a comparison diagram between solid-state and lithium-ion batteries courtesy of Samsung. Another benefit you get from solid-state batteries is the fact that these batteries bring a lower power density and higher energy density. These batteries are already commonly used in electric vehicles. When they do come to smartphones as well they will actually result in phone batteries being smaller in size but packing larger capacity. These days a 5000 mAh lithium-ion battery is considerably larger than a solid-state battery can do at the same capacity. \n\nSolid-state batteries also showcase a lower self-discharge  which could theoretically improve the standby timing of smartphones. These batteries offer incredible resistance to heat allowing for faster charging and considering how there is no limitation to how they have to be designed these batteries can be made into really thin or minimal options with ease. All of this is thanks to the fact that you are not looking at any liquid involved. \n\nBut what are the benefits of solid-state batteries over lithium-ion batteries? Considering solid-state batteries and how smartphone manufacturers have been trying to bring them out into the market it is safe to assume that you get some advantages from them. Especially when you compare them to your traditional lithium-ion batteries but this makes us wonder about the type of advantages there are. After all this new technology has to be viable enough right?\n\n The first benefit you will get from solid-state batteries is that they are *smaller in size* and *lighter in weight.* These batteries are already available in some capacity but if they make their way to smartphones we can expect them to be thinner and lighter than usual. Another benefit of solid-state batteries is that they can have over *2.5 times higher energy density*. Which as mentioned before allows for higher-capacity batteries with ease. You are also getting *better safety overall* since there are no flammable components and you do not have to worry about the batteries catching fire. Solid-state batteries also happen to be really good for their charging speed  as an ideal battery can charge*4 to 6 times faster* than what is currently available in the market. The *production is also faster* on these batteries thanks to the fact that they do not use as many components. Last but not least  solid state batteries can withstand lower and higher temperatures much better thanks to *excellent thermal stability*. \\nEven though solid-state batteries are the future some glaring issues cannot be overlooked.While it is true that we see solid-state batteries in electric vehicles and hoping to see them in smartphones  there are some glaring issues that one cannot overlook.These issues appear more prominent when you look at them through the lens of the smartphone industry rather than something else. For instance  the *production cost of these batteries is higher* than what companies would pay for lithium-ion batteries.Therefore  manufacturing them on a larger scale would be challenging.Sure  Samsung has its own battery division  which is good.Considering how the company is actively working on improving the technology and bringing it to the mainstream  we might see them having an easier time.But still  we cannot say much for now. Another thing that can be a hindrance is that the *high internal resistance* can often become a hurdle when it comes to the charging and discharging of the battery  as it can slow things down.Not just that  *electrode material* ends up accumulating inside the battery  which is considered a chemical flaw  and can affect the battery's overall health mainly when it is used over time. Another thing about solid-state batteries is that when they are being charged  the thickness of the lithium-metal anode goes through expansion  and it starts contracting when it is discharged--this can cause overall deterioration in the battery  and keeping the battery fixed in a place could be difficult.There is no denying that solid-state batteries are the future. Considering how Samsung  along with other companies  is betting the future on this battery technology  it would be interesting to see where the road takes us.However  at the time of writing  saying when these batteries would be available on all smartphones is hard to say.And when they do how do companies plan on overcoming all the negatives and operational issues associated with these batteries? We will have to wait and see.",
        "author": "Abhishek Mishra",
        "publishDate": "26-3-2023",
        "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2023/03/david-ballew-YD9EOAQwKhs-unsplash.jpg"      },
        
      {
        "id": 2,
        "title": "Intel’s Super-Massive LGA 7529 Socket Pictured, Ready For Next-Gen Xeon CPUs With Up To 132-Core P-Cores & 512 E-Cores",
        "content": "Intel's next-generation LGA 7529 socket which will be used by future Xeon CPUs with up to 512 cores has been pictured in insane detail. Intel LGA 7529 Socket With Support For Up To 512 Core Xeon CPUsPictured On Engineering Motherboard Although we have already seen the Intel LGA 7529 socket in close-up shots  the new pictures come from an engineering motherboard that was acquired by Bilibili content creator  @不拉更的Harry & Machine Soul. The motherboard is still an early design that has the ES labeling slapped across all corners  including the socket itself (reads prototype & made by LOTES). The LGA 7529 socket will be part of the Intel Mountain Stream platform which is designed for the next-gen Granite Rapids and Sierra Forest chips The leaker of this Intel LGA 7529 socket engineering motherboard anticipates that the upcoming Xeon platform will support P-Core variants with up to 86 and 132 cores  E-Core variants with up to 334 and 512 cores  as well as HBM variants.The motherboard will be fully compliant with the PCIe Gen 5.0 interface featuring at least 96 Gen 5 lanes. The memory layout will include support for 12-channel DDR5-6400 memory at the start with Granite Rapids chips. These 12 channels would allow for up to 24 RDIMM slots for an insane DRAM capacity.The Intel Ultra Path Interconnect (UPI) and bandwidth have also been enhanced for the LGA 7529 socket motherboards. The PCB connection is also expected to be far superior to competitor AMD. The motherboard lacks a southbridge chip section for using hard drive controllers  input and output controllers  and integrated hardware.It should be noted that the LGA 7529 socket for the new CPU is much larger than the LGA 4189 socket  but both do share the same pin density.The socket is so big that it can literally house at least five Intel 13th Gen Desktop CPUs or six AMD Ryzen 7000 CPUs.The PCIe 5.0 Mini Cool Edge IO (MCIO) connector will support a link width of x16 and will be used for the UPI  additional PCIE  GENZ  and CEM connections. The R2214914 VRMs will power the processor and memory with 105A  but the DrMOS is unknown. The platform is designed to easily handle the first-gen chips rated between 400-500W.The new Sierra Forest Xeon CPUs are rumored to deliver power and performance to support high-density  ultra-efficient computing for the cloud. The Sierra Forest Xeon chips will house at least 344 cores packed within 4 Compute Tiles  each packing 86 cores. If the rumors are correct  there will also be a larger core count version with 528 cores  offering up to 132 cores per tile. It is anticipated that 512 cores would be a more realistic core count  with one cluster being disabled.The continued expectation for Intel from users is that the company will attempt to outperform AMD's current and future EPYC platforms. Sierra Forest is anticipated to compete with AMD's Bergamo processors that offer 128 Zen 4C cores  and Falcon Shores will go head-to-head with the custom Instinct APU accelerators. The Instinct APU accelerators will introduce the upcoming MI300 acceleratorthat will launch later in the year. Intel's Sierra Forest processors are expected to launch in 2024  utilizing the Intel 3 (3nm) process node.",
        "author": "Kajal Mishra",
        "publishDate": "25-3-2023",
        "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2023/03/Intel-LGA-7529-Socket-Motherboard-For-Next-Gen-Xeon-CPUs-_6-Custom.png"},
      {
        "id": 3,
        "title": "Samsung Rumored to Develop Its Own Mobile GPU Like Apple, Qualcomm, To Reduce Dependency On ARM’s Mali Lineup",
        "content": "The Exynos 2200’s Xclipse 920 GPU was the result of a partnership between Samsung and AMD  and it looks like the SoC was the stepping stone the Korean giant needed to jump to the next phase; developing a custom GPU. This practice is nothing new  as companies dedicated to developing smartphone chipsets  like Apple and Qualcomm  launch successive silicon with custom GPUs.Samsung likely to form IP  mobile GPU development could be based on AMD’s RDNA architecture The Xclipse 920 GPU  which is part of the Exynos 2200  was based on AMD’s RDNA2 architecture. Apparently  this same architecture will be used to develop the custom GPU  at least according to Revegnus  who posted on Twitter. However  Samsung will not develop a standalone GPU  and will likely require AMD’s help to form an IP. For several years  and until the Exynos 2100  Samsung relied on ARM’s Mali GPU designs  and all of this could change. While there is little to complain about in ARM’s GPU designs  the efforts of Qualcomm and Apple reveal that the performance gap from Samsung’s side can only be reduced through a custom GPU tailor-made for smartphones. In his tweet  Revegnus states that we should not hold our breath for the launch of this graphics processor because  at the very least  we will see it in three years. Looking at this rumored timeline  Samsung can also delay the launch if the custom GPU does not perform according to the company’s expectations. To be fair  the Korean giant has not had the best success with smartphone chipset releases  but with the right talent  this goal can be achieved. Samsung also has an Exynos 2300 in the works  along with the Xclipse 930 GPU but according to a previous rumor  the upcoming Tensor G3 expected to be found in the Pixel 8 and Pixel 8 Pro will be based on it.These revelations suggest that the company is committed to releasing chipsets and there was also a rumor doing the rounds that Samsung was pursuing the development of custom CPU cores Also  in ray tracing tests  the Exynos 2200’s Xclipse 920 held its own against the Snapdragon 8 Gen 2  actually beating Qualcomm’s latest and greatest showing that there is potential for Samsung here. Hopefully  the first real competitor to Apple’s GPU will not be a disappointment.",
        "author": "Sundar Pichai",
        "publishDate": "24-3-2023",
        "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2023/03/Samsungs-and-AMDs-partnership.jpg"
    },

    {
      "id": 4,
      "title": "Snapdragon 8cx Gen 4 Engineering Sample Shows Up On Geekbench With 12-Core CPU Configuration RAM Clock Speed Details Also Shown",
      "content": "The Snapdragon 8cx Gen 4 is said to be Qualcomm’s first SoC sporting the company’s custom Oryon coresand multiple specification details of the SoC were now spotted on Geekbench. Unfortunately the chipset obtains a low single-core and multi-core score but thankfully what you are about to read refers to an engineering sample. Snapdragon 8cx Gen 4 is beaten by the Snapdragon 8cx Gen 3 with ewer CPU cores indicating a commercial version will take time to arrive. The codename mentioned in the Geekbench screenshots is ‘Hamoa’ suggesting that this is indeed Qualcomm’s upcoming silicon. Sadly evidence spotted by Twitter user Gustave Monceshows rather low single-core and multi-core scores showing that the silicon is still under testing and likely needs additional tweaks before it shows performance numbers that rival Apple’s M-series. In the Geekbench screenshot we noticed that there is also a ‘Power Plan’ meaning that users will probably have the option to let the Snapdragon 8cx Gen 4 run at a higher performance level or lower its clock speeds to deliver extended battery life. This feature is usually present in Windows desktops and notebooks and the engineering sample was allegedly tested with Windows 11. On this occasion the Power Plan was running at ‘Balanced. ’ Snapdragon 8cx Gen 4 achieves a poor score on Geekbench. We also reported on a massive specifications leak of the upcoming Snapdragon SoC talking about its 12-core CPU configuration. That same configuration was spotted on Geekbench showing eight performance cores and four power-efficiency ones. However where the lowest clock speed is listed as 2. 38GHz in the screenshots the low-power cores are supported to operate at 2. 50GHz. Then again Geekbench always shows the lowest possible frequencies so we do not believe this is anything to be concerned about. The Snapdragon 8cx Gen 4 can support up to 64GB LPDDR5 RAM and the engineering sample is showing 16GB memory which is not out of place. What was out of place was that the Snapdragon 8cx Gen 3 is actually faster than the engineering sample but there is nothing to be disappointed about this as it is usual behavior from engineering samples. However we hope that a commercial unit is spotted on Geekbench 6 as quickly as possible so we can look at its performance with a cleaner impression and compare it to Apple’s M2 Pro and M2 Max.",
      "author": "Bill Gates",
      "publishDate": "29-3-2023",
      "imageUrl": "https://cdn.wccftech.com/wp-content/uploads/2023/03/Snapdragon-8cx-Gen-4.jpg"}
  


    ]
  }
  